{
  "architecture": {
    "backend": "tensorflow",
    "class_name": "Model",
    "config": {
      "input_layers": [
        [
          "input_4",
          0,
          0
        ]
      ],
      "layers": [
        {
          "class_name": "InputLayer",
          "config": {
            "batch_input_shape": [
              null,
              7,
              352
            ],
            "dtype": "float32",
            "name": "input_4",
            "sparse": false
          },
          "inbound_nodes": [],
          "name": "input_4"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_100",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "input_4",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_100"
        },
        {
          "class_name": "Reshape",
          "config": {
            "name": "reshape_7",
            "target_shape": [
              7,
              352,
              1
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_100",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "reshape_7"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_101",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "reshape_7",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_101"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_100",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_101",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_100"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_82",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_100",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_82"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_102",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_82",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_102"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_101",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_102",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_101"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              201
            ],
            "name": "conv2d_81",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_101",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_81"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_49",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "reshape_7",
                0,
                0,
                {}
              ],
              [
                "conv2d_81",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_49"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_103",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_49",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_103"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_102",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_103",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_102"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_84",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_102",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_84"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_104",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_84",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_104"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_103",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_104",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_103"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              201
            ],
            "name": "conv2d_83",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_103",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_83"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_50",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_49",
                0,
                0,
                {}
              ],
              [
                "conv2d_83",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_50"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_105",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_50",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_105"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_104",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_105",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_104"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_86",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_104",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_86"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_106",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_86",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_106"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_105",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_106",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_105"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              201
            ],
            "name": "conv2d_85",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_105",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_85"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_51",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_50",
                0,
                0,
                {}
              ],
              [
                "conv2d_85",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_51"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_107",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_51",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_107"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_106",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_107",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_106"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_88",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_106",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_88"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_108",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_88",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_108"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_107",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_108",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_107"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              201
            ],
            "name": "conv2d_87",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_107",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_87"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_52",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_51",
                0,
                0,
                {}
              ],
              [
                "conv2d_87",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_52"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_109",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_52",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_109"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_108",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_109",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_108"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_90",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_108",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_90"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_110",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_90",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_110"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_109",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_110",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_109"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              201
            ],
            "name": "conv2d_89",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_109",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_89"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_53",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_52",
                0,
                0,
                {}
              ],
              [
                "conv2d_89",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_53"
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "data_format": "channels_last",
            "name": "max_pooling2d_16",
            "padding": "valid",
            "pool_size": [
              1,
              2
            ],
            "strides": [
              1,
              2
            ],
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_53",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "max_pooling2d_16"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_111",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_16",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_111"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_110",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_111",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_110"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_92",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_110",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_92"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_112",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_92",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_112"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_111",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_112",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_111"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              101
            ],
            "name": "conv2d_91",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_111",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_91"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_54",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "max_pooling2d_16",
                0,
                0,
                {}
              ],
              [
                "conv2d_91",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_54"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_113",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_54",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_113"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_112",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_113",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_112"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              7,
              1
            ],
            "name": "conv2d_94",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_112",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_94"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_114",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "conv2d_94",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_114"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_113",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_114",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_113"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
                "seed": null
              }
            },
            "kernel_regularizer": null,
            "kernel_size": [
              1,
              101
            ],
            "name": "conv2d_93",
            "padding": "same",
            "strides": [
              1,
              1
            ],
            "trainable": true,
            "use_bias": true
          },
          "inbound_nodes": [
            [
              [
                "activation_113",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "conv2d_93"
        },
        {
          "class_name": "Add",
          "config": {
            "name": "add_55",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_54",
                0,
                0,
                {}
              ],
              [
                "conv2d_93",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "add_55"
        },
        {
          "class_name": "BatchNormalization",
          "config": {
            "axis": -1,
            "beta_constraint": null,
            "beta_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "beta_regularizer": null,
            "center": true,
            "epsilon": 0.001,
            "gamma_constraint": null,
            "gamma_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "gamma_regularizer": null,
            "momentum": 0.99,
            "moving_mean_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "moving_variance_initializer": {
              "class_name": "Ones",
              "config": {}
            },
            "name": "batch_normalization_115",
            "scale": true,
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "add_55",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "batch_normalization_115"
        },
        {
          "class_name": "Activation",
          "config": {
            "activation": "relu",
            "name": "activation_114",
            "trainable": true
          },
          "inbound_nodes": [
            [
              [
                "batch_normalization_115",
                0,
                0,
                {}
              ]
            ]
          ],
          "name": "activation_114"
        },
        {
          "class_name": "Conv2D",
          "config": {
            "activation": "linear",
            "activity_regularizer": null,
            "bias_constraint": null,
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "bias_regularizer": null,
            "data_format": "channels_last",
            "dilation_rate": [
              1,
              1
            ],
            "filters": 1,
            "kernel_constraint": null,
            "kernel_initializer": {
              "class_name": "VarianceScaling",
              "config": {
                "distribution": "uniform",
                "mode": "fan_avg",
                "scale": 1.0,
